#include "hMain.h"
#include "COM.h"
#include <string>
#include <chrono>
#include <thread>
#include <fstream>
#include "smmintrin.h"
#include "xmmintrin.h"
#include "emmintrin.h"
#include "Variable.h"
using namespace std;
#pragma warning(disable:4996)

DWORD64 CAMPTR = 0x1747E40;
DWORD64 GAPTR = 0x2818118; // 0x27014A0 - 48 8B 05 CB144A02     - mov rax,[GameAssembly.dll+27014A0] { (1F213628EB0) }

//#define FULL

enum Bone_List : int 
{
	l_hip = 1,
	l_knee,
	l_foot,
	l_toe,
	l_ankle_scale,
	pelvis,

	penis,
	GenitalCensor,
	GenitalCensor_LOD0,
	Inner_LOD0,
	GenitalCensor_LOD1,
	GenitalCensor_LOD2,
	r_hip,
	r_knee,
	r_foot,
	r_toe,
	r_ankle_scale,
	spine1,
	spine1_scale,
	spine2,
	spine3,
	spine4,
	l_clavicle,
	l_upperarm,
	l_forearm,
	l_hand,
	l_index1,
	l_index2,
	l_index3,
	l_little1,
	l_little2,
	l_little3,
	l_middle1,
	l_middle2,
	l_middle3,
	l_prop,
	l_ring1,
	l_ring2,
	l_ring3,
	l_thumb1,
	l_thumb2,
	l_thumb3,
	IKtarget_righthand_min,
	IKtarget_righthand_max,
	l_ulna,
	neck,
	head,
	jaw,
	eyeTranform,
	l_eye,
	l_Eyelid,
	r_eye,
	r_Eyelid,
	r_clavicle,
	r_upperarm,
	r_forearm,
	r_hand,
	r_index1,
	r_index2,
	r_index3,
	r_little1,
	r_little2,
	r_little3,
	r_middle1,
	r_middle2,
	r_middle3,
	r_prop,
	r_ring1,
	r_ring2,
	r_ring3,
	r_thumb1,
	r_thumb2,
	r_thumb3,
	IKtarget_lefthand_min,
	IKtarget_lefthand_max,
	r_ulna,
	l_breast,
	r_breast,
	BoobCensor,
	BreastCensor_LOD0,
	BreastCensor_LOD1,
	BreastCensor_LOD2,
	collision,
	displacement,
};

class PlayerBase
{
public:
	char pad_0x0000[0x1EC]; //0x0000
	__int32 lifestate; //0x01EC 
	char pad_0x01F0[0x4]; //0x01F0
	float hp; //0x01F4 
	char pad_0x01F8[0x298]; //0x01F8
	__int64 playermodel; //0x0490 
	char pad_0x0498[0x60]; //0x0498
	__int32 team; //0x04F8 
	char pad_0x04FC[0x34]; //0x04FC
	__int32 activeitem; //0x0530 
	char pad_0x0534[0xC]; //0x0534
	__int64 modelstate; //0x0540 
	char pad_0x0548[0x68]; //0x0548
	__int32 flags; //0x05B0 
	char pad_0x05B4[0xC]; //0x05B4
	__int64 inventory; //0x05C0 
	char pad_0x05C8[0x10]; //0x05C8
	__int64 input; //0x05D8 
	__int64 movement; //0x05E0 
	char pad_0x05E8[0x30]; //0x05E8
	__int64 nameptr; //0x0618 

}; //Size=0x0620


struct Player
{
	DWORD64 base;
	DWORD64 vector;
	string name;
	int layer;
	float distance;
};

struct VECTOR3D
{
	float x;
	float y;
	float z;
};

struct MATRIX
{
	float _11;
	float _12;
	float _13;
	float _14;
	float _21;
	float _22;
	float _23;
	float _24;
	float _31;
	float _32;
	float _33;
	float _34;
	float _41;
	float _42;
	float _43;
	float _44;
};

struct Matrix34
{
	D3DXVECTOR4 vec0;
	D3DXVECTOR4 vec1;
	D3DXVECTOR4 vec2;
};

Player Gamer[1000];

int playercount = 0;

DWORD64 baseAdress;
DWORD64 baseAdressGA;
DWORD64 viewMatrixPtr = NULL;
DWORD64 vectorPtr;
DWORD64 healthDecAddress = NULL;


DWORD64 localplayer;
D3DXMATRIX viewMatrix;
D3DXVECTOR3 myloc;
D3DXVECTOR3 enemyloc;
KeInterface Driver;
MATRIX mat;
float distanceaim = NULL;
D3DXVECTOR3 aimloc;


void DR();
void GetIni();
void GE();
void BN();

//void SG(DWORD64 inventory, int currentitem);
